src/Catalogs/Организации/Организации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Организации</name>
  <comment>Организации</comment>
  <attributes>
    <name>ВариантНаименованияДляПечатныхФорм</name>
    <type>
      <types>EnumRef.ВариантыНаименованияДляПечатныхФорм</types>
    </type>
  </attributes>
  <attributes>
    <name>ИндивидуальныйПредприниматель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодИМНС</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКАТО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКПО</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоОКТМО</name>
    <comment>(Регл) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИМНС</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеОКВЭД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>254</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПлательщикаПриПеречисленииНалогов</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеСокращенное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОГРН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойБанковскийСчет</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Префикс</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоДатаВыдачи</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СвидетельствоСерияНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическоеФизическоеЛицо</name>
    <type>
      <types>EnumRef.ЮридическоеФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаРегистрации</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлЛоготип</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлФаксимильнаяПечать</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияКонтактнойИнформации</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/CommonForms/уатПерсональныеНастройки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	уатЗащищенныеФункцииСервер.уатСправочникФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	ТекПользователь = ПользователиКлиентСервер.АвторизованныйПользователь();
	ПредПользователь = ТекПользователь;
	АдминистративныеПрава = ПравоДоступа("Администрирование", Метаданные);
	Если НЕ АдминистративныеПрава Тогда
		Элементы.ТекПользователь.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЗаполнитьТаблицуНастроек();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда 
		Если НастройкиМодифицированы() Тогда
			Отказ = Истина;
			ТекстПредупреждения = НСтр("en='Personal settings changed. All changes will be lost.';ru='Персональные настройки изменены. Все изменения будут потеряны.'");
			Возврат;
		КонецЕсли;
	ИначеЕсли НастройкиМодифицированы() Тогда 
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		ТекстНСТР = НСтр("en='Personal settings changed. To abandon the changes and close the form?';ru='Персональные настройки изменены. Отказаться от изменений и закрыть форму?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("ПередЗакрытиемЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ОКОтмена);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	уатЗащищенныеФункцииКлиент.уатСправочникФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТекПользовательПриИзменении(Элемент)
	ПоискПольз = НайтиПользователяИБ(ТекПользователь);
	Если ПоискПольз = Ложь Тогда
		ТекстНСТР = СтрШаблон(НСтр("en='Settings are only saved for users of IB. User ""%1"" is not a user of IB!';ru='Настройки сохраняются только для пользователей ИБ. Пользователь ""%1"" не является пользователем ИБ!'"), ТекПользователь);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		ТекПользователь = ПредПользователь;
		Возврат;
	КонецЕсли;
	
	Если ТекПользователь = ПредПользователь Тогда
		Возврат;
	КонецЕсли;
	
	Если НастройкиМодифицированы() Тогда
		Ответ = Неопределено;
		ТекстНСТР = СтрШаблон(НСтр("en='Personal settings of user ""%1"" changed! Save changes?';ru='Персональные настройки пользователя ""%1"" изменены! Сохранить изменения?'"), ПредПользователь);
		ПоказатьВопрос(Новый ОписаниеОповещения("ТекПользовательПриИзмененииЗавершение", ЭтотОбъект), ТекстНСТР, РежимДиалогаВопрос.ДаНетОтмена);
        Возврат;
	КонецЕсли;
	
	ТекПользовательПриИзмененииФрагмент1();
КонецПроцедуры

&НаКлиенте
Процедура НастройкиПользователейЗначениеПриИзменении(Элемент)
	Элементы.НастройкиПользователей.ТекущиеДанные.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Если НастройкиМодифицированы() Тогда
		СохранитьНастройки();
		ОбновитьНастройкуПодтверждениеПриЗавершенииПрограммы();
	КонецЕсли;
	
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	СохранитьНастройки();
	ОбновитьНастройкуПодтверждениеПриЗавершенииПрограммы();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСохраненным(Команда)
	Ответ = Неопределено;

	ПоказатьВопрос(Новый ОписаниеОповещения("ВернутьсяКСохраненнымЗавершение", ЭтотОбъект), НСтр("en='Back to the saved settings?';ru='Вернуться к сохраненным значениям настроек?'"), РежимДиалогаВопрос.ОКОтмена);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает набор настроек пользователя УАТ
//
Функция ПолучитьСписокНастроекПользователяУАТ()
	тблНастройки = Новый ТаблицаЗначений;
	тблНастройки.Колонки.Добавить("ИмяНастройки");
	тблНастройки.Колонки.Добавить("Представление");
	тблНастройки.Колонки.Добавить("ЗначениеПоУмолчанию");
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ЗапрашиватьПодтверждениеПриЗавершенииПрограммы";
	НоваяСтрока.Представление = НСтр("en='Request confirmation at program termination';ru='Запрашивать подтверждение при завершении программы'");
	НоваяСтрока.ЗначениеПоУмолчанию = ОбщегоНазначения.ОбщиеПараметрыБазовойФункциональности().ЗапрашиватьПодтверждениеПриЗавершенииПрограммы;
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнаяЕдиницаПоКлассификатору";
	НоваяСтрока.Представление = НСтр("en='Basic unit by classifier';ru='Основная единица по классификатору'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнаяОрганизация";
	НоваяСтрока.Представление = НСтр("en='Main company';ru='Основная организация'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.Организации.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнаяСтавкаНДС";
	НоваяСтрока.Представление = НСтр("en='Basic VAT rate';ru='Основная ставка НДС'");
	НоваяСтрока.ЗначениеПоУмолчанию = Перечисления.СтавкиНДС.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновноеПодразделениеОрганизации";
	НоваяСтрока.Представление = НСтр("en='Basic department of company';ru='Основное подразделение организации'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнойОтветственный";
	НоваяСтрока.Представление = НСтр("en='Main responsible';ru='Основной ответственный'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.Пользователи.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнойПокупатель";
	НоваяСтрока.Представление = НСтр("en='Main buyer';ru='Основной покупатель'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.Контрагенты.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнойПоставщик";
	НоваяСтрока.Представление = НСтр("en='Main supplier';ru='Основной поставщик'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.Контрагенты.ПустаяСсылка();
	
	НоваяСтрока = тблНастройки.Добавить();
	НоваяСтрока.ИмяНастройки = "ОсновнойСклад";
	НоваяСтрока.Представление = НСтр("en='Main warehouse';ru='Основной склад'");
	НоваяСтрока.ЗначениеПоУмолчанию = Справочники.Склады.ПустаяСсылка();
	
	тблНастройки.Сортировать("Представление");
	
	Возврат тблНастройки;
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНастроек()
	тблНастройкиПользователей = ПолучитьСписокНастроекПользователяУАТ();
	
	НастройкиПользователей.Очистить();
	
	Для Каждого ТекНастройка Из тблНастройкиПользователей Цикл
		ТекЗначениеНастройки = уатОбщегоНазначенияПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(ТекПользователь, ТекНастройка.ИмяНастройки);
		Если ТекЗначениеНастройки = Неопределено Тогда
			ТекЗначениеНастройки = ТекНастройка.ЗначениеПоУмолчанию;
		КонецЕсли;
		НоваяСтрока = НастройкиПользователей.Добавить();
		НоваяСтрока.Настройка = ТекНастройка.ИмяНастройки;
		НоваяСтрока.Представление = ТекНастройка.Представление;
		НоваяСтрока.Значение = ТекЗначениеНастройки;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройки(Знач Пользователь = Неопределено)
	Если Пользователь = Неопределено Тогда
		Пользователь = ТекПользователь;
	КонецЕсли;
	
	мсвСтрокМодифицированных = НастройкиПользователей.НайтиСтроки(Новый Структура("Модифицированность", Истина));
	Для Каждого ТекСтрока Из мсвСтрокМодифицированных Цикл
		уатОбщегоНазначенияПовтИсп.УстановитьЗначениеПоУмолчанию(ТекСтрока.Настройка, ТекСтрока.Значение, Пользователь);
		ТекСтрока.Модифицированность = Ложь;
	КонецЦикла;
	
	Если мсвСтрокМодифицированных.Количество() > 0 Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция НастройкиМодифицированы()
	мсвСтрокМодифицированных = НастройкиПользователей.НайтиСтроки(Новый Структура("Модифицированность", Истина));
	Возврат (мсвСтрокМодифицированных.Количество() > 0);
КонецФункции

&НаСервере
Функция НайтиПользователяИБ(ТекПользователь)
	Возврат ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
		уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(ТекПользователь, "ИдентификаторПользователяИБ")) <> Неопределено;
КонецФункции

&НаКлиенте
Процедура ТекПользовательПриИзмененииЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.Да Тогда
        СохранитьНастройки(ПредПользователь);
    ИначеЕсли Ответ = КодВозвратаДиалога.Нет Тогда
    Иначе
        ТекПользователь = ПредПользователь;
        Возврат;
    КонецЕсли;
    
    ТекПользовательПриИзмененииФрагмент1();

КонецПроцедуры

&НаКлиенте
Процедура ТекПользовательПриИзмененииФрагмент1()
    
    ТекПользовательПриИзмененииФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура ТекПользовательПриИзмененииФрагмент()
    
    ЗаполнитьТаблицуНастроек();
    ПредПользователь = ТекПользователь;

КонецПроцедуры

&НаКлиенте
Процедура ВернутьсяКСохраненнымЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
    Если Ответ = КодВозвратаДиалога.ОК Тогда
        ЗаполнитьТаблицуНастроек();
    КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытиемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Ответ = РезультатВопроса;
	Если Ответ = КодВозвратаДиалога.ОК Тогда
		Для Каждого ТекСтрока из НастройкиПользователей Цикл
			ТекСтрока.Модифицированность = Ложь;
		КонецЦикла;
		Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкуПодтверждениеПриЗавершенииПрограммы()
	Если ТекПользователь = ПользователиКлиентСервер.АвторизованныйПользователь() Тогда 
		Для Каждого ТекСтрока Из НастройкиПользователей Цикл
			Если Не ВРег(ТекСтрока.Настройка) = ВРег("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы") Тогда 
				Продолжить;
			КонецЕсли;
			
			СтандартныеПодсистемыКлиент.УстановитьПараметрКлиента("ЗапрашиватьПодтверждениеПриЗавершенииПрограммы", ТекСтрока.Значение);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
		
#КонецОбласти
